# Add/Remove Rows and Columns from Dataframes

* Adding Columns

In [1]:
# Importing pandas library and loading data
import pandas as pd
df = pd.read_csv(r"C:\Users\battih\Desktop\Personal\Python\data\extracted_data\survey_results_public.csv")
schema_df = pd.read_csv(r"C:\Users\battih\Desktop\Personal\Python\data\extracted_data\survey_results_schema.csv")

In [3]:
people = {
    'first' : ['Huzefa', 'Jane', 'John'],
    'last' : ['Battiwala', 'Doe', 'Doe'],
    'email' : ['battih@gmail.com', 'johndoe@gmail.com', 'janedoe@gmail.com']
}

dict_df = pd.DataFrame(people)

Adding columns: Combine fist and last name

In [7]:
dict_df['full_name'] = dict_df['first'] + " " + dict_df['last']

In [8]:
dict_df

    first       last              email         full_name
0  Huzefa  Battiwala   battih@gmail.com  Huzefa Battiwala
1    Jane        Doe  johndoe@gmail.com          Jane Doe
2    John        Doe  janedoe@gmail.com          John Doe

In [12]:
# Adding column with apply method
dict_df['full_name'] = dict_df.apply(lambda row: str(row['first']) + ' ' + str(row['last']),axis=1)

In [13]:
dict_df

    first       last              email         full_name
0  Huzefa  Battiwala   battih@gmail.com  Huzefa Battiwala
1    Jane        Doe  johndoe@gmail.com          Jane Doe
2    John        Doe  janedoe@gmail.com          John Doe

Removing columns: Using drop method to drop the columns

In [15]:
dict_df.drop(columns=['first', 'last'],inplace=True)

### Concatenating new record(s) from dataframe

In [19]:
dict_df[['first', 'last']] = dict_df['full_name'].str.split(' ',expand=True)

In [20]:
dict_df

               email         full_name   first       last
0   battih@gmail.com  Huzefa Battiwala  Huzefa  Battiwala
1  johndoe@gmail.com          Jane Doe    Jane        Doe
2  janedoe@gmail.com          John Doe    John        Doe

In [24]:
new_row = pd.DataFrame([{'first':'Tony'}])
dict_df = pd.concat([dict_df, new_row], ignore_index=True)
dict_df

               email         full_name   first       last
0   battih@gmail.com  Huzefa Battiwala  Huzefa  Battiwala
1  johndoe@gmail.com          Jane Doe    Jane        Doe
2  janedoe@gmail.com          John Doe    John        Doe
3                NaN               NaN    Tony        NaN

In [25]:
people = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers',],
    'email' : ['ironman@email.com', 'cap@email.com']
}

dict_df1 = pd.DataFrame(people)
dict_df1

   first    last              email
0   Tony   Stark  ironman@email.com
1  Steve  Rogers      cap@email.com

In [28]:
dict_df = pd.concat([dict_df,dict_df1],ignore_index=True)

In [29]:
dict_df

               email         full_name   first       last
0   battih@gmail.com  Huzefa Battiwala  Huzefa  Battiwala
1  johndoe@gmail.com          Jane Doe    Jane        Doe
2  janedoe@gmail.com          John Doe    John        Doe
3                NaN               NaN    Tony        NaN
4  ironman@email.com               NaN    Tony      Stark
5      cap@email.com               NaN   Steve     Rogers

In [33]:
# Removing rows
dict_df.drop(index=3)

               email         full_name   first       last
0   battih@gmail.com  Huzefa Battiwala  Huzefa  Battiwala
1  johndoe@gmail.com          Jane Doe    Jane        Doe
2  janedoe@gmail.com          John Doe    John        Doe
4  ironman@email.com               NaN    Tony      Stark
5      cap@email.com               NaN   Steve     Rogers

In [40]:
filt = (dict_df['last'] == 'Doe')
dict_df.drop(index=dict_df[filt].index)

               email         full_name   first       last
0   battih@gmail.com  Huzefa Battiwala  Huzefa  Battiwala
3                NaN               NaN    Tony        NaN
4  ironman@email.com               NaN    Tony      Stark
5      cap@email.com               NaN   Steve     Rogers